IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGRAM-A.
       
       PROCEDURE DIVISION.
       MAIN-LOGIC.
           CALL "PROGRAM-B"
           CALL "PROGRAM-C"
           STOP RUN.