IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGRAM-B.
       
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DATA-FILE ASSIGN TO "DATA.DAT".
       
       PROCEDURE DIVISION.
       PROCESS.
           CALL "PROGRAM-D"
           STOP RUN.